{
	"resources": {
		"imgs": {

			"end": "/game/static/tan_engine/the_end.png",
			"class": "/game/static/tan_engine/class.jpg",

			"teach": "/game/static/tan_engine/ch_teach.png"
		}
	},
	"script": [
		["scene", { "img": "class" } ],
		["char", { "img": "teach", "position": "right"} ],
		["say", { "char": "Учитель", "text": "О, а вот и наш новый ученик." }],
		["say", {
			"char": "Учитель",
			"text": "Привет, %имя%. Ты как раз вовремя, второй пробный урок скоро начнется."
		}],
		["say", {
			"char": "Учитель",
			"text": "Привет. Ты как раз вовремя, второй пробный урок скоро начнется."
		}],
		["say", {
			"char": "Учитель",
			"text": "Я буду преподавать тебе Python ближайшее время"
		}],
		["say", {
			"char": "Учитель",
			"text": "Я лишь замещаю остальных учителей, отправившихся на хакатон, но надеюсь что мы классно проведем время."
		}],
		["say", {
			"char": "Учитель",
			"text": "Это наше второе занятие, но на первом толком не было ничего важного кроме объяснений что такое программирование, алгоритмы и python"
		}],
		["label", "end_quest1"],
		["menu", [{
				"text": "Что такое программирование и зачем оно нужно?",
				"to": "what_is_code"
			},
			{
				"text": "Что такое алгоритмы?",
				"to": ""
			},
			{
				"text": "Что такое python?",
				"to": "what_is_py"
			},
			{
				"text": "Начать следующий урок",
				"to": "start_lesson"
			}
		]],
		["label", "what_is_code"],
		["say", {
			"char": "Учитель",
			"text": "Компьютерное программирование - это способ сказать компьютеру, как делать определенные вещи, давая ему инструкции. Эти инструкции называются программами. Человек, который пишет инструкции, является программистом. Эти инструкции поступают на разных языках; они называются языками программирования."
		}],
		["to", "end_quest1"],
		["label", "what_is_alg"],
		["say", {
			"char": "Учитель",
			"text": "Это последовательность действий, исполнителя для достижения результата."
		}],
		["say", {
			"char": "Учитель",
			"text": "Такими исполнителями могут быть, например люди или компьютеры. В программировании изучают алгоритмы для компьютеров - программы."
		}],
		["to", "end_quest1"],
		["label", "what_is_py"],
		["say", {
			"char": "Учитель",
			"text": "Питон это мощный язык программирования, во многом похожий на множество других языков, но имеющий важные отличия. Такие как:<ul><li>Интерпретируемость</li><li>Простой и наглядный синтаксис</li><li>Универсальность</li><li>Большая стандартная библиотека</li><li>Написанные с любовью фреймворки на все случаи жизни</li><li></li></ul>"
		}],
		["say", {
			"char": "Учитель",
			"text": "Также стоит упомянуть что есть несколько версий питона на данный момент и изучать мы будем именно Python3"
		}],
		["to", "end_quest1"],
		["label", "start_lesson"],
		["say", {
			"char": "Учитель",
			"text": "На этом уроке мы займемся практикой. Напишите заранее <a href = \"//tlgg.ru/SchlDemoPy\">боту</a>, который поможет выполнять код."
		}],
		["say", {
			"char": "Учитель",
			"text": "Этот <a href = \"//tlgg.ru/SchlDemoPy\">бот</a> создан чтобы компилировать код и выводить результат. Для того чтобы <a href = \"//tlgg.ru/SchlDemoPy\">бот</a> что-то вывел, следует использовать команду <code>print</code>. Попробуйте написать этому боту такие команды как <code>print(23), print(0.1+0.2), print(print),print(meaning)</code> можно все в одном сообщении"
		}],
		["say", {
			"char": "Учитель",
			"text": "Если вы ввели все команды, вы наверняка увидели ошибку <code>NameError: name 'meaning' is not defined<code>. Знатоки английского, любители гуглить или опытные программисты сразу поняли в чем дело. Питон не нашел у себя переменную <code>meaning</code>."
		}],
		["say", {
			"char": "Учитель",
			"text": "Практически все в питоне является переменной. Переменная это особое имя, которое дается программистами отдельным объектам. для того чтобы задать переменную, достаточно просто дать ей значение, например <code>meaning=42</code> или <code>apple_color=”red”</code>."
		}],
		["say", {
			"char": "Учитель",
			"text": "Кавычки используются для обозначения строк, объектов которые являются только набором символов"
		}],
		["say", {
			"char": "Учитель",
			"text": "Наш бот пока не  является интерпретатором и не запоминает переменные между сообщениями, поэтому код нужно отправлять целиком."
		}],
		["say", {
			"char": "Учитель",
			"text": "Давайте проверим ваши знания"
		}],
		["say", {
			"char": "Учитель",
			"text": "Ваше первое задание - написать программу которая выводит <code>“hello world”</code>"
		}],
		["code", "2"],
		["say", {
			"char": "Учитель",
			"text": "Это задание довольно простое. "
		}],
		["say", {
			"char": "Учитель",
			"text": "В то же время поздравляю с осознанно написанной программой на python3"
		}],
		["say", {
			"char": "Учитель",
			"text": "В дальнейшем нам в заданиях также понадобиться использовать команду <code>input</code>"
		}],
		["say", {
			"char": "Учитель",
			"text": "<code>input</code> используется для того чтобы вводить информацию в программу нашими системами проверки  или вашими будущими пользователями с клавиатуры"
		}],
		["say", {
			"char": "Учитель",
			"text": "<code>input</code> является командой которая возвращает строки в подставленные переменные. Даже если пользователь или система проверки введет цифры. Для того чтобы положить в переменную цифры, нужно использовать промежуточную команду <code>int</code>"
		}],
		["say", {
			"char": "Учитель",
			"text": "В вашем следующем задании вам нужно дополнить код, который считает сумму двух вводимых чисел так, чтобы он считал сумму трех вводимых чисел"
		}],
		["code", "1"],
		["say", {
			"char": "Учитель",
			"text": "Данное задание позволяет поближе познакомится с процессом тестирования в нашей школе. Вы неплохо справляетесь для новичка."
		}],
		["say", {
			"char": "Учитель",
			"text": "Но боюсь время подходит к концу. "
		}],
		["say", {
			"char": "Учитель",
			"text": "До встречи на следующем занятии"
		}],
		["scene", {
			"img": "end"
		}]


	]
}
